app/controllers/tasks_controller.rb

SELECT * FROM "tasks"
---
  def index
    @tasks = Task.all

INSERT INTO "tasks" ("created_at", "title", "updated_at", "description") VALUES('2010-03-16 18:57:47', NULL, '2010-03-16 18:57:47', NULL)
---
  def create
    priority = Priority.find_by_id params[:task][:priority][:id]
    params[:task].delete :priority
    @task = Task.new(params[:task])
    @task.priority = priority;
    if @task.save